# Options from data/options.py
SIMPLIFIED_OPTIONS = [
    "стер латекс 1-хлор", "стер латекс", "стер латекс 2-хлор", "стер нитрил",
    "хир", "хир 1-хлор", "хир с полимерным", "хир 2-хлор", "хир изопрен",
    "хир нитрил", "ультра", "гинекология", "двойная пара", "микрохирургия",
    "ортопедия", "латекс диаг гладкие", "латекс диаг", "латекс 2-хлор",
    "латекс с полимерным", "латекс удлиненный", "латекс анатомической",
    "латекс hr", "латекс 1-хлор", "нитрил диаг", "нитрил диаг hr короткий",
    "нитрил диаг hr удлиненный"
]

COLOR_OPTIONS = ["белый", "зеленый", "натуральный", "розовый", "синий", "фиолетовый", "черный"]
VENCHIK_OPTIONS = ["с венчиком", "без венчика"]
SIZE_OPTIONS = [
    "XS", "S", "M", "L", "XL", "5,0", "5,5", "6,0", "6,5",
    "7,0", "7,5", "8,0", "8,5", "9,0", "9,5", "10,0"
]
UNITS_OPTIONS = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 20, 25, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 125, 250, 500]

COLOR_REQUIRED = [
    "латекс 1-хлор", "латекс 2-хлор", "латекс HR", "латекс анатомической",
    "латекс диаг", "латекс диаг гладкие", "латекс с полимерным",
    "латекс удлиненный", "нитрил диаг", "нитрил диаг HR короткий",
    "нитрил диаг HR удлиненный", "стер лат 1-хлор", "стер лат 2-хлор",
    "ультра"
]

VENCHIK_REQUIRED = [
    "гинекология", "микрохирургия", "ортопедия"
]